## 산술 연산
#### Series 연산
###### 숫자연산)  Series객체 + 연산자( +, - , * , / ) + 숫자
###### 시리즈연산)  Series객체 + 연산자( +, - , * , / ) + Series객체
###### 연산 메소드)  Series객체.연산메소드( Series객체, fill_value=0)

In [1]:
# 모듈 로딩
import pandas as pd

In [2]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1=pd.Series({'국어':100, '영어':80, '수학':90})
student1

국어    100
영어     80
수학     90
dtype: int64

In [3]:
# 학생의 과목별 점수를 200으로 나누기
percentage=student1/200
percentage, type(percentage)

(국어    0.50
 영어    0.40
 수학    0.45
 dtype: float64,
 pandas.core.series.Series)

In [4]:
student1=pd.Series({'국어':100, '영어':80, '수학':90})
student2=pd.Series({'수학':80, '국어':90, '영어':80})
student1, student2

(국어    100
 영어     80
 수학     90
 dtype: int64,
 수학    80
 국어    90
 영어    80
 dtype: int64)

In [6]:
# 두 학생의 과목별 점수로 사칙연산 수행
add = student1 + student2 # 덧셈
sub = student1 - student2 # 뺄셈
mul = student1 * student2 # 곱셈
div = student1 / student2 # 나눗셈
add, sub, mul, div, type(div)

(국어    190
 수학    170
 영어    160
 dtype: int64,
 국어    10
 수학    10
 영어     0
 dtype: int64,
 국어    9000
 수학    7200
 영어    6400
 dtype: int64,
 국어    1.111111
 수학    1.125000
 영어    1.000000
 dtype: float64,
 pandas.core.series.Series)

In [7]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([add, sub, mul, div], index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [8]:
# 두 학생의 과목별 점수로 사칙연산 수행 (연산 메소드 사용)
# 공백 인덱스, NaN 연산 피하기 -> fill_value

sr_add = student1.add(student2, fill_value=0) # 덧셈
sr_sub = student1.sub(student2, fill_value=0) # 뺄셈
sr_mul = student1.mul(student2, fill_value=0) # 곱셈
sr_div = student1.div(student2, fill_value=0) # 나눗셈

In [10]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result2=pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result2

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

#### DataFrame 연산
###### 숫자 연산)   DataFrame객체 + 연산자( +, - , * , / ) + 숫자
###### 시리즈 연산)   DataFrame객체 + 연산자( +, - , * , / ) + DataFrame 객체
###### 연산 메소드)  DataFrame객체.연산메소드( DataFrame객체, fill_value=0)

In [11]:
exam_data={'이름':['서준','우현','인아'],
           '수학' : [ 90, 80, 70],
           '영어' : [ 98, 89, 95],
           '음악' : [ 85, 95, 100],
           '체육' : [ 100, 90, 90]}
df=pd.DataFrame(exam_data)

In [12]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [13]:
# 데이터프레임에 숫자 2 곱하기
df2 = df * 2
df2

     수학   영어   음악   체육
이름
서준  180  196  170  200
우현  160  178  190  180
인아  140  190  200  180

In [14]:
# 데이터프레임 - 데이터프레임
sub = df2 - df
sub

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [18]:
# 데이터프레임 + 데이터프레임
add = df2 + df

print(add)
print(type(add))

     수학   영어   음악   체육
이름
서준  270  294  255  300
우현  240  267  285  270
인아  210  285  300  270

<class 'pandas.core.frame.DataFrame'>